package com.company.Samos;

import org.w3c.dom.ls.LSOutput;

public class Main {
    public static void main(String[] args){
        //Task1 - Human
//        Human h1 = new Human();
//        System.out.println(h1.getName());
//        h1.getOlder();
//        System.out.println(h1.getAge());
//        h1.sayHello();
//
//        Human h2 = new Human("Андрей", 6);
//        System.out.println(h2.getName());
//        h2.getOlder();
//        System.out.println(h2.getAge());
//        h2.sayHello();
//        h2.rest();

        //Task2 - Dog

        //Task3 - Добавить наследника ворк и метод реализацию
//        Human.Work h3 = new Human.Work();
//        h3.work();

        //Task4 - к предыдущим заданиям добавить абстрактный класс Creature, с абстракт методом live().б
//        h3.life();

        //Task5 - на основании класса из задания 1  реализовать анонимный класс, в который нужно добавить метод rest() - отдыхаю
//        Human h4 = new Human(){
//           @Override
//           public void rest(){
//               System.out.println(this.getName() + " Отдыхает на море");
//            }
//        };
//        h4.rest();


//Создать супер класс Shape и его наследников Circle, Rectangl
        //создать абстрактный метод Draw(), а также переменную хранящую цвет
        //Класс Cir and Rect хранят координаты точек
        //Создать массив хранящий эти фигуры
        //Вызвать метод Draw у всех фигур

        //v1
//        Shape[] arr1 = new Shape[2];
//        String[] str1 = new String[]{"Прямоугольник", "Круг"};
//        arr1[0] = new Rectangl();
//        arr1[1] = new Circle();

        //v2
//        Shape[] arr1 = new Shape[]{new Rectangl(), new Circle()};
//
//        arr1[0].Draw();
//        arr1[1].Draw();


    }
}