package com.company.Lesson.OOP.Lesson15;

public class Lesson15 {

//    class SIMCARDRF {
//        public static String code = "+7";
//        public String phoneNumber;
//        public SIMCARDRF(String phoneNumber) {
//            this.phoneNumber = phoneNumber;
//        }
//
//        public void getNumber(){
//            System.out.println(SIMCARDRF.code + this.phoneNumber);
//        }
//    }

//Создать класс банковский агент. Добавить поле инд. счет, там хранится актив агента в долларах. Также добавить переменную общую для всех, казна банка.
// У агента должен быть метод добровольной передачи денег в казну банка. Напоминаю, что казна для всех одна, если первый агент дает 10 долларов, и казна была пустая, то когда
// второй агент даст 30 долларов, в казне будет 40
    public static void main (String[] args){

//        BankAgent15 Tom = new BankAgent15(100);
//        BankAgent15 Mot = new BankAgent15(1000);
//        BankAgent15 Otm = new BankAgent15(1500);
//
//        Tom.getMoney(100);
//        Tom.getInfo();
//        Mot.getMoney(100);
//        Mot.getInfo();
//        Otm.getMoney(150);
//        Otm.getInfo();
//        System.out.println();
//        BankAgent15.getKazna();

        //Task3
//        int [] arr = new int[] {1, 4, 3, 7, 81, 144, 92};
//        Task.task3(arr);

    }
}
