package com.company.Samos1;
//Создайте интерфейс ISort. В нём должно быть два
//метода:
//■ void SortAsc() — сортировка по возрастанию;
//■ void SortDesc() — сортировка по убыванию.
//
//Класс Array, созданный ранее, должен имплементиро-
//вать интерфейс ISort.
//
//Метод SortAsc — сортирует массив по возрастанию.
//Метод SortDesc — сортирует массив по убыванию.
//
//Напишите код для тестирования полученной функ-
//циональности.

public interface iSort {
    void SortAsc();
    void SortDesc();

}
