package com.company.Lesson.OOP.Lesson14;
//Создать абстрактный класс Car, в котором будет два абстрактных метода: метод открытие дверей, второй метод сигнализация. Также добавить поля и сеттеры геттеры для них, добавить свой метод
//public abstract class Car{
//    private String model;
//    private String brend;
//    public void getInfo(){
//        System.out.println(this.model + " " + this.brend);
//    }

//    public Car(){
//    }
//
//    public Car (String model, String brend){
//        this.model = model;
//        this.brend = brend;
//    }
//
//    public String getModel(){
//        return model;
//    }
//
//    public void setModel(String model){
//        this.model = model;
//    }
//
//    public String getBrend(){
//        return brend;
//    }
//
//    public void setBrend(String brend){
//        this.brend = brend;
//    }
//
//    public abstract void openDoor();
//
//    public abstract void signalSi();
//
//    public void Gaz(){
//        System.out.println("Нажал педаль газа");
//    }
//
//    public void tormoz(){
//        System.out.println("Нажад педаль тормоза");
//    }
//
//}
